from aiogram import Router, types

router = Router()


@router.message(lambda message: message.text == "/help" or message.text == "Помощь 🆘")
async def cmd_help(message: types.Message):
    await message.answer(
        "Мои функции на данный момент:\n"
        "/start - активация бота\n"
        "/help - помощь по боту\n"
        "/search_help - справка по функциям\n"
        "/search - поиск статей по BusinessChain, MakeEvents, ЕЛК, Beehive\n"
        "/videos - поиск по видео (В разработке)\n"
        "Выбирай что угодно - а я тебе помогу"
    )


@router.message(
    lambda message: message.text == "/search_help" or message.text == "Справка"
)
async def cmd_search_help(message: types.Message):
    await message.answer(
        "Справка для поиска по статьям:\n"
        '1. Нажимаем "Поиск статей"\n'
        "2. Выбираем нужный для нас ресурс из списка кнопок\n"
        "3. Напишите 2-3 тега для поиска или подходящее словосочетание\n"
        "Далее бот найдет наиболее подходящие по смыслу статьи и покажет вам\n\n"
        "Справка для поиска по видео\n"
        "В разработке!"
    )


if __name__ == "__main__":
    print("You must use main.py")
